tangyangguang/Esp32Base/src/web/internal/WebTools.cpp
#include "../../Esp32BaseProfile.h"

#if ESP32BASE_ENABLE_WEB

#include "WebInternal.h"

namespace esp32base_web {

#if ESP32BASE_ENABLE_FILELOG
void sendFileLogModeOption(const char* value, const char* label, Esp32BaseFileLog::Mode mode) {
    sendChunk("<label><input type='radio' name='mode' value='");
    sendEscapedHtmlChunk(value);
    sendChunk("'");
    if (Esp32BaseFileLog::mode() == mode) {
        sendChunk(" checked");
    }
    sendChunk("> ");
    sendEscapedHtmlChunk(label);
    sendChunk("</label> ");
}

bool fileLogModeFromArg(const String& raw, Esp32BaseFileLog::Mode& mode) {
    if (raw == "off") {
        mode = Esp32BaseFileLog::OFF;
        return true;
    }
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_ERROR
    if (raw == "error") {
        mode = Esp32BaseFileLog::ERROR;
        return true;
    }
#endif
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_WARN
    if (raw == "warn") {
        mode = Esp32BaseFileLog::WARN;
        return true;
    }
#endif
#if ESP32BASE_LOG_LEVEL >= ESP32BASE_LOG_INFO
    if (raw == "info") {
        mode = Esp32BaseFileLog::INFO;
        return true;
    }
#endif
    return false;
}

const char* fileLogModeName(Esp32BaseFileLog::Mode mode) {
    switch (mode) {
        case Esp32BaseFileLog::ERROR: return "ERROR";
        case Esp32BaseFileLog::WARN: return "WARN";
        case Esp32BaseFileLog::INFO: return "INFO";
        case Esp32BaseFileLog::OFF:
        default: return "OFF";
    }
}

const char* fileLogRuntimeStateName() {
    if (Esp32BaseFileLog::faulted()) {
        return "write fault";
    }
    if (Esp32BaseFileLog::isEnabled()) {
        return "enabled";
    }
    return Esp32BaseFileLog::mode() == Esp32BaseFileLog::OFF ? "disabled" : "unavailable";
}

Esp32BaseWeb::UiTone fileLogRuntimeStateTone() {
    return Esp32BaseFileLog::faulted() ? Esp32BaseWeb::UI_WARN :
           (Esp32BaseFileLog::isEnabled() ? Esp32BaseWeb::UI_OK :
            (Esp32BaseFileLog::mode() == Esp32BaseFileLog::OFF ? Esp32BaseWeb::UI_INFO : Esp32BaseWeb::UI_WARN));
}

bool fileLogHasRuntimeDetails() {
    return Esp32BaseFileLog::faulted() || Esp32BaseFileLog::isEnabled() || Esp32BaseFileLog::mode() != Esp32BaseFileLog::OFF;
}

void sendFileLogRuntimeStateTag() {
    sendStatusTag(fileLogRuntimeStateTone(), fileLogRuntimeStateName());
}

void sendFileLogRuntimeStateRow(const char* label) {
    sendInfoRowStart(label);
    sendFileLogRuntimeStateTag();
    sendInfoRowEnd();
}

void sendFileLogRuntimeNotice() {
    if (Esp32BaseFileLog::faulted()) {
        sendChunk("<p class='notice warn'>New system log writes are stopped after a FS write failure. Existing system diagnostic logs may still be readable. Clear space or save the system log mode again after maintenance.</p>");
    } else if (!Esp32BaseFileLog::isEnabled() && Esp32BaseFileLog::mode() != Esp32BaseFileLog::OFF) {
        sendChunk("<p class='notice warn'>System logs are unavailable because FileLog could not initialize with the current filesystem state. Check LittleFS, format if needed, or save the system log mode again after maintenance.</p>");
    } else if (Esp32BaseFileLog::mode() == Esp32BaseFileLog::OFF) {
        sendChunk("<p class='notice info'>System log mode is OFF. Existing system diagnostic logs are historical; new logs are not written.</p>");
    }
}
#endif

void sendFooterBarModeOption(const char* value, const char* label, Esp32BaseWeb::FooterBarMode mode) {
    sendChunk("<label><input type='radio' name='mode' value='");
    sendEscapedHtmlChunk(value);
    sendChunk("'");
    if (Esp32BaseWeb::footerBarMode() == mode) {
        sendChunk(" checked");
    }
    sendChunk("> ");
    sendEscapedHtmlChunk(label);
    sendChunk("</label> ");
}

bool footerBarModeFromArg(const String& raw, Esp32BaseWeb::FooterBarMode& mode) {
    if (raw == "off") {
        mode = Esp32BaseWeb::FOOTER_BAR_OFF;
        return true;
    }
    if (raw == "status") {
        mode = Esp32BaseWeb::FOOTER_BAR_STATUS_ONLY;
        return true;
    }
    if (raw == "full") {
        mode = Esp32BaseWeb::FOOTER_BAR_FULL;
        return true;
    }
    return false;
}

#if ESP32BASE_ENABLE_WIFI_RECOVERY_BUTTON
bool parseToolsUnsigned(const String& raw, uint32_t minimum, uint32_t maximum, uint32_t& out) {
    if (raw.length() == 0 || raw[0] == '-' || raw[0] == '+') {
        return false;
    }
    char* end = nullptr;
    const unsigned long value = strtoul(raw.c_str(), &end, 10);
    if (!end || *end != '\0' || value < minimum || value > maximum) {
        return false;
    }
    out = static_cast<uint32_t>(value);
    return true;
}

void sendWifiRecoveryPanel() {
    const Esp32BaseWiFi::RecoveryButtonConfig config = Esp32BaseWiFi::recoveryButtonConfig();
    const Esp32BaseWiFi::RecoveryButtonConfig defaults = Esp32BaseWiFi::defaultRecoveryButtonConfig();
    char value[32];
    sendChunk("<section class='panel actionpanel recoverypanel'><div class='paneltitle'><h2>WiFi recovery button</h2>");
    sendStatusTag(config.enabled ? Esp32BaseWeb::UI_OK : Esp32BaseWeb::UI_NEUTRAL,
                  config.enabled ? "enabled" : "disabled");
    sendChunk("</div><p class='muted recoveryintro'>Hold the configured button after startup to open the WiFi configuration hotspot.</p><div class='recoveryfacts'><span><b>GPIO</b><em>");
    snprintf(value, sizeof(value), "%d", static_cast<int>(config.gpio));
    sendEscapedHtmlChunk(value);
    sendChunk("</em></span><span><b>Long press</b><em>");
    snprintf(value, sizeof(value), "%lu seconds", static_cast<unsigned long>(config.holdMs / 1000UL));
    sendEscapedHtmlChunk(value);
    sendChunk("</em></span><span><b>Build default</b><em>");
    snprintf(value, sizeof(value), "GPIO %d · %lu seconds",
             static_cast<int>(defaults.gpio),
             static_cast<unsigned long>(defaults.holdMs / 1000UL));
    sendEscapedHtmlChunk(value);
    sendChunk("</em></span></div><form class='editform recoveryform' method='post' action='/esp32base/system/wifi-recovery' onsubmit=\"return once(this)\"><label class='recoverytoggle'><input type='checkbox' name='enabled' value='1'");
    if (config.enabled) {
        sendChunk(" checked");
    }
    sendChunk("><span><b>Enable physical recovery</b><small>Uses an active-low input with the internal pull-up.</small></span></label><div class='recoveryfields'><div class='field'><label for='wifi-recovery-gpio'>GPIO</label><input id='wifi-recovery-gpio' name='gpio' type='number' min='0' max='127' value='");
    sendIntChunk(config.gpio);
    sendChunk("' required></div><div class='field'><label for='wifi-recovery-hold'>Long press</label><div class='inputunit'><input id='wifi-recovery-hold' name='hold_seconds' type='number' min='1' max='60' step='1' value='");
    sendIntChunk(static_cast<int>(config.holdMs / 1000UL));
    sendChunk("' required><span>seconds</span></div></div></div>");
    sendChunk("<p class='notice warn recoverywarning'><b>Pin safety:</b> GPIO changes immediately. The library rejects invalid and known flash pins; board-level PSRAM, USB, peripheral and application conflicts remain the application's responsibility.</p>");
    sendChunk("<p class='muted recoverynote'>A successful hold preserves saved credentials and opens the hotspot at 192.168.4.1. Press the BOOT button only after startup; holding it during reset or power-on enters ROM download mode.</p>");
    sendChunk("<div class='actions'><input type='submit' value='Save Recovery Button'></div></form></section>");
}
#endif

