tangyangguang/Esp32Base/src/web/internal/WebTools.cpp
void handleToolsRebootPost() {
    markRequest();
    if (!ensurePostAllowed("tools_reboot")) {
        return;
    }
    ESP32BASE_LOG_W("web", "restart_requested source=tools");
    Esp32BaseWeb::sendHeader("Rebooting");
    sendChunk("<script>history.replaceState(null,'','/esp32base/system?restarting=1');</script>");
    Esp32BaseWeb::sendPageTitle("Rebooting", "Device restart was accepted.");
    sendChunk("<section class='panel actionpanel'><h2>Restart requested</h2><p class='muted'>Device is restarting. Please wait a few seconds, then reload the System page.</p><div class='actions'><a class='btnlink' href='/esp32base/system'>Reload System</a></div></section>");
    Esp32BaseWeb::sendFooter();
    delay(100);
    Esp32BaseSystem::restart("web");
}

#if ESP32BASE_ENABLE_WATCHDOG
void handleToolsWatchdogTripResetPost() {
    markRequest();
    if (!ensurePostAllowed("tools_watchdog_trip_reset")) {
        return;
    }
    const uint32_t lifetime = Esp32BaseWatchdog::lifetimeResetCount();
    const uint32_t resetTime = currentWatchdogTripResetTime();
    const bool writeOk = Esp32BaseConfig::setInt("eb_sys", "wdt_trip_base", static_cast<int32_t>(lifetime)) &&
                         Esp32BaseConfig::setInt("eb_sys", "wdt_trip_time", static_cast<int32_t>(resetTime));
    const bool verifyOk = Esp32BaseConfig::getInt("eb_sys", "wdt_trip_base", -1) == static_cast<int32_t>(lifetime) &&
                          Esp32BaseConfig::getInt("eb_sys", "wdt_trip_time", -1) == static_cast<int32_t>(resetTime);
    const bool ok = writeOk && verifyOk;
    ESP32BASE_LOG_W("web", "watchdog_trip_reset_requested source=tools lifetime=%lu time=%lu result=%s",
                    static_cast<unsigned long>(lifetime),
                    static_cast<unsigned long>(resetTime),
                    ok ? "success" : "failed");
    redirectSeeOther(ok ? "/esp32base/system?watchdog_trip_reset=1" : "/esp32base/system?error=watchdog_trip_reset_failed");
}
#endif

void handleToolsFormatFsPost() {
    markRequest();
    if (!ensurePostAllowed("tools_format_fs")) {
        return;
    }
#if ESP32BASE_ENABLE_FS
    ESP32BASE_LOG_W("web", "fs_format_requested source=tools");
    Esp32BaseStorage::FormatResult result;
    const bool ok = Esp32BaseStorage::formatAndReload(result);
    ESP32BASE_LOG_W("web", "fs_format_completed source=tools format=%s mount=%s filelog_reload=%s business_stores_reload=%u/%u result=%s",
                    result.formatSuccess ? "success" : "failed",
                    result.mountSuccess ? "success" : "failed",
                    result.fileLogReloadSuccess ? "success" : "failed",
                    static_cast<unsigned>(result.recordStoreReloadedCount),
                    static_cast<unsigned>(result.recordStoreCount),
                    ok ? "success" : Esp32BaseStorage::lastErrorReason());
    if (result.formatSuccess) {
        notifyToolsFormatFsSuccess(result.mountSuccess,
                                   result.fileLogReloadSuccess,
                                   result.recordStoreCount,
                                   result.recordStoreReloadedCount);
    }
    if (ok) {
        redirectSeeOther("/esp32base/system?formatted=1");
    } else {
        redirectSeeOther(!result.formatSuccess ? "/esp32base/system?error=format_failed" :
                         !result.mountSuccess ? "/esp32base/system?error=mount_failed" :
                         "/esp32base/system?error=storage_reload_failed");
    }
#else
    ESP32BASE_LOG_W("web", "fs_format_requested source=tools result=unavailable");
    redirectSeeOther("/esp32base/system?error=fs_unavailable");
#endif
}

void handleToolsLogsClearPost() {
    markRequest();
    if (!ensurePostAllowed("tools_logs_clear")) {
        return;
    }
#if ESP32BASE_ENABLE_FILELOG
    const bool ok = Esp32BaseFileLog::clear();
    redirectSeeOther(ok ? "/esp32base/system?logs_cleared=1" : "/esp32base/system?error=logs_clear_failed");
#else
    redirectSeeOther("/esp32base/system?error=logs_unavailable");
#endif
}

#if ESP32BASE_ENABLE_RECORD_STORE
void handleToolsBusinessRecordsClearPost() {
    markRequest();
    if (!ensurePostAllowed("tools_business_records_clear")) {
        return;
    }
    Esp32BaseStorage::ClearResult result;
    ESP32BASE_LOG_W("web", "business_records_clear_requested source=tools stores=%u",
                    static_cast<unsigned>(Esp32BaseStorage::recordStoreCount()));
    const bool ok = Esp32BaseStorage::clearRecordStores(result);
    char location[128];
    if (ok) {
        snprintf(location, sizeof(location),
                 "/esp32base/system?business_records_cleared=%u%s",
                 static_cast<unsigned>(result.recordStoreClearedCount),
                 result.cleanupWarningCount ? "&cleanup_warning=1" : "");
    } else {
        snprintf(location, sizeof(location),
                 "/esp32base/system?business_records_clear_failed=1&cleared=%u&total=%u",
                 static_cast<unsigned>(result.recordStoreClearedCount),
                 static_cast<unsigned>(result.recordStoreCount));
    }
    ESP32BASE_LOG_W("web", "business_records_clear_completed source=tools cleared=%u total=%u warnings=%u result=%s",
                    static_cast<unsigned>(result.recordStoreClearedCount),
                    static_cast<unsigned>(result.recordStoreCount),
                    static_cast<unsigned>(result.cleanupWarningCount),
                    ok ? "success" : "failed");
    redirectSeeOther(location);
}
#endif


} // namespace esp32base_web

#endif
